Polycom-Open-Firmware/brainslug/serial-bridge/sdkconfig.defaults
# slug-1 (wESP32 / ESP32) as a dumb USB<->serial adapter for C60-#2.
# 4 MB flash; free UART0 + silence bootloader/console so the host sees a
# clean C60-#2 stream (no ESP boot spam).
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_ESP_CONSOLE_UART_NONE=y
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
CONFIG_BOOTLOADER_LOG_LEVEL=0
CONFIG_LOG_DEFAULT_LEVEL_NONE=y
CONFIG_LOG_DEFAULT_LEVEL=0
